Tekla Open API Reference for Tekla Structures 2025
PourBreak.PourBreakAttributes Class
 The PourBreakAttributes class is the attributes class for the pour break.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.PourBreak.PourBreakAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourBreakAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class PourBreakAttributes
	Inherits AttributesBase
The PourBreak.PourBreakAttributes type exposes the following members.
Constructors
Name | Description
PourBreak.PourBreakAttributes()
 Creates a new default pour break attributes instance that loads standard attributes.
PourBreak.PourBreakAttributes(String)
 Creates a new pour break attributes instance that loads the specified attributes.
Top
Properties
Name | Description
DrawHiddenLines
 Indicates whether hidden lines are used to draw the pour break or not.
HiddenLines
 The hidden line type of the pour break.
VisibleLines
 The visible line type of the pour break.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace